In [1]:
import numpy as np
import pandas as pd

In [2]:
pwd

'F:\\Udemy Python ML Course\\Lesson Notebooks\\03-Python-for-Data-Analysis-Pandas'

In [3]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df.to_csv('example',index=False)

In [5]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [7]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [9]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

____

In [12]:
from sqlalchemy import create_engine

In [13]:
engine = create_engine('sqlite:///:memory:')

In [15]:
df[0].to_sql('data', engine)

In [21]:
sql_df = pd.read_sql('data',con=engine, index_col='index')

In [22]:
sql_df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
index,,,,,,,
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"